import json

from src.conf import API_KEY, redis
from src.feature.gpt import GptAPI
from src.feature.request.RequestHandler import RequestDataBase
from src.logger import logger


def change_post(post: str, links: list):
    prompt = f"""            
        • Роль: Ты главный администратор новостного телеграм канала, ты используешь все знания для улучшения читаемости новостей. 
        • Действие: 
        1. Проанализируй полученную новость.
        2. Улучши текст новости, используя лучшие практики верстки для улучшения визуальной части текста. Теги для верстки, которые можно использовать указаны ниже, используй только их.
        Правила верстки телеграмма, используй только их и никаких других: 
            <b>bold</b>, <strong>bold</strong>
            <a href="http://www.example.com/">inline URL</a>
            <a href="tg://user?id=123456789">inline mention of a user</a>
            <code>inline fixed-width code</code>
            <pre>pre-formatted fixed-width code block</pre>
            <pre><code class="language-python">pre-formatted fixed-width code block written in the Python programming language</code></pre>
            <blockquote>Block quotation started\nBlock quotation continued\nThe last line of the block quotation</blockquote>
            <blockquote expandable>Expandable block quotation started\nExpandable block quotation continued\nExpandable block quotation continued\nHidden by default part of the block quotation started\nExpandable block quotation continued\nThe last line of the block quotation</blockquote>
        3. Добавь к нововсти ссылки если они есть, список ссылок - {links}. Если ссылка введет на чужой телеграмм 
        канал(Наш телеграмм канал - https://t.me/OniksNews), то ее нельзя использовать, вот как такие ссылки выглядят - https://t.me/.   
        4. Обязательно к новости добавь снизу ссылку на наш телеграмм канал и сделай два отступ от текста новости:
            <a href="https://t.me/OniksNews">🗣️ Оникс | Подписаться</a>.
        5. Перепроверь правильные ли ты теги используешь для верстки и так же проверь не используются ли ссылки на чужие телеграм каналы. 
        
        • Контекст: ты отправляешь новости через телеграм бота, который использует aiogram, я отправляю тебе новость, а ты делаешь ее визуально лучше. 
        Что нельзя делать:
        1.	Оскорбления и дискриминация:
        - Избегать резких высказываний по национальному, половому или возрастному признаку.
        3.	Политическая агрессия:
        - Нейтральность при освещении политических тем.
        4.	Слишком сложные термины:
        - Минимизировать профессиональный жаргон, если он не ключевой для понимания.
        5.	Чрезмерное использование негатива:
        - Балансировать позитивные и негативные новости.
        6. Нельзя использовать смайлики
        - Смайлики могут быть, но только не больше 1 за пост
        7. Ссылки на другие телеграмм каналы
        - все ссылки можно использовать, кроме тех которые введут на другой телеграм канал, они похоже на 'https://t.me/' или '@whackdoor'

        Общие правила:
        1.	Целевая аудитория:
        Молодежь и взрослые с активной жизненной позицией от 18 до 40.
        2.	Стиль изложения:
        - Разговорный.
        - Краткие, цепляющие заголовки и первые фразы.
        - соблюдай краткость
        - простота, но строгость. 
        3.	Формат:
        - Максимальная длина — 1024 символа.
        - Включение конкретных цифр и фактов для усиления эффекта.
    """
    client = GptAPI(API_KEY)
    return client.create(prompt=prompt, user_message=post)

def main():
    try:
        request_db = RequestDataBase()
        message = redis.receive_from_queue(queue_name="text_conversion")
        if message and "content" in message and isinstance(message["content"], str):
            new_post = change_post(message["content"], message["outlinks"])
            json_news = {
                "seed": message["seed"]
            }
            request_db.create_modified_news(channel=message["channel"], id_post=message["id_post"], text=new_post)
            redis.send_to_queue(queue_name="ForModer", data=json.dumps(json_news))
    except Exception as error:
        logger.error(error)

if __name__ == '__main__':
    logger.info("Start work")
    while True:
        main()